export default {
  owner: {
    shortname: "عروة",
    name: "عروة شمس",
    description: "راح اعملك منتجك الرقمي يلي عطول حلمت في",
    developer:
      "مواقع الويب🌐, تطبيقات للهاتف📱 أو برامج مخصصة ومصممة لتلبية احتياجاتك الخاصة",
  },
  general: {
    name: "اسم",
    description: "وصف",
    examples: "أمثلة",
    link: "رابط",
    pick: "يمكنك اختيار خيار من الأسفل",
    or_pick_custom: "أو يمكنك طلب حل برمجي مخصص",
  },
  templates: {
    custom: {
      name: "برامج مخصصة",
      description: "حل برمجي مخصص، بناءً على احتياجاتك الخاصة",
    },
    e_commerce: {
      name: "تجارة إلكترونية",
      description: "منصات إلكترونية لبيع وشراء السلع أو الخدمات",
      examples: {
        amazon: {
          name: "أمازون",
          description: "سوق إلكتروني لبيع وشراء المنتجات",
          link: "https://www.amazon.com/",
        },
        hoddies: {
          name: "هوديس",
          description: "ملابس وإكسسوارات للرجال والنساء",
          link: "https://www.hoodies.co.il/",
        },
        space_posters: {
          name: "ملصقات الفضاء",
          description: "ملصقات تعرض صورًا متعلقة بالفضاء",
          link: "https://www.spaceposters.co/",
        },
      },
    },
    social_media: {
      name: "وسائل التواصل الاجتماعي",
      description: "مواقع تسهل التفاعل الاجتماعي ومشاركة المحتوى",
      examples: {
        facebook: {
          name: "فيسبوك",
          description:
            "خدمة وسائل التواصل الاجتماعي والشبكات الاجتماعية عبر الإنترنت",
          link: "https://www.facebook.com/",
        },
        twitter: {
          name: "تويتر",
          description:
            "المعروفة الآن باسم X، هي خدمة تواصل اجتماعي عبر الإنترنت",
          link: "https://www.twitter.com/",
        },
        instagram: {
          name: "إنستغرام",
          description: "خدمة مشاركة الصور والفيديو عبر الإنترنت",
          link: "https://www.instagram.com/",
        },
      },
    },
    personal_website: {
      name: "مدونة/موقع الشخصي",
      description: "منصات فردية أو تنظيمية لتبادل المعلومات أو الآراء",
      examples: {
        medium: {
          name: "ميديوم",
          description: "منصة بسيطة للكتابة ومشاركة المقالات",
          link: "https://medium.com/",
        },
        theo_blog: {
          name: "مدونة ثيو براون",
          description:
            "مدونة كتبها ثيو براون، منشئ المحتوى والمؤسس والرئيس التنفيذي لشركة Ping Labs-ping.gg",
          link: "https://t3.gg/blog",
        },
        rauchg_blog: {
          name: "مدونة غييرمو راوخ",
          description:
            "مدونة كتبها Guillermo Rauch، الرئيس التنفيذي لشركة vercel والمؤلف الأصلي لـ Next.js",
          link: "https://rauchg.com/",
        },
      },
    },
    news_media_website: {
      name: "موقع أخبار وإعلام",
      description:
        "المواقع التي تقدم الأخبار والمقالات ومحتوى الوسائط المتعددة",
      examples: {
        cnn: {
          name: "سي إن إن",
          description: "قناة إخبارية متعددة الجنسيات",
          link: "https://www.cnn.com/",
        },
        walla: {
          name: "والا نيوز",
          description: "خدمة الأخبار والمعلومات الإسرائيلية على الإنترنت",
          link: "https://news.walla.co.il/",
        },
        skynewsarabia: {
          name: "سكاي نيوز عربية",
          description:
            "سكاي نيوز عربية هي قناة إخبارية عربية تبث على مدار 24 ساعة تبث بشكل رئيسي في منطقة الشرق الأوسط وشمال أفريقيا",
          link: "https://www.skynewsarabia.com/",
        },
      },
    },
    portfolio_website: {
      name: "موقع بورتفوليو",
      description: "مواقع الويب الشخصية أو المهنية لعرض مشاريعك",
      examples: {
        bruno_simon: {
          name: "بورتفوليو برونو سيمون",
          description:
            "ربما يكون موقع بورتفوليو الأكثر شهرة، حيث يمكنك بالفعل قيادة سيارة افتراضية بين مشاريعه وتجربته باستخدام لوحة المفاتيح",
          link: "https://bruno-simon.com/",
        },
        yui_moreau: {
          name: "بورتفوليو يوي مورو",
          description:
            "وُلد يوي مورو في سيول، ومقره في باريس، ولديه موقع بورتفوليو يجذب انتباهك منذ البداية من خلال مونتاجه الخلفي الرائع للفيديو القديم",
          link: "https://y78.fr/",
        },
        jessica_hernandez: {
          name: "بورتفوليو جيسيكا هيرنانديز",
          description:
            "إذا كنت تبحث عن مثال ممتاز لبورتفوليو تعطي انطباعًا أوليًا جيدًا، فهذا هو المثال الذي يجب عليك التحقق منه بالتأكيد",
          link: "https://www.jessicahernandez.me/",
        },
      },
    },
    corporate_website: {
      name: "موقع شركة",
      description:
        "التواجد عبر الإنترنت للشركات، وغالبًا ما يتضمن معلومات الشركة وخدماتها",
      examples: {
        pienso: {
          name: "بينسو",
          description:
            "بينسو هي منصة الذكاء الاصطناعي التفاعلية التي يمكن لأي شخص استخدامها لتحويل البيانات النصية إلى رؤى، دون الحاجة إلى أي ترميز",
          link: "https://pienso.com/",
        },
        nvidia: {
          name: "نفيديا",
          description:
            "تخترع نفيديا وحدة معالجة الرسومات وتحقق تقدمًا في الذكاء الاصطناعي والحوسبة عالية الأداء والألعاب والتصميم الإبداعي والمركبات المستقلة والروبوتات",
          link: "https://www.nvidia.com/",
        },
        asus: {
          name: "آسوس",
          description:
            "آسوس هي شركة تايوانية متعددة الجنسيات لأجهزة الكمبيوتر والإلكترونيات الاستهلاكية",
          link: "https://www.asus.com/",
        },
      },
    },
    government_website: {
      name: "موقع إلكتروني حكومي",
      description: "المواقع الرسمية للجهات الحكومية، تقديم المعلومات والخدمات",
      examples: {
        nasa: {
          name: "ناسا",
          description: "الإدارة الوطنية للملاحة الجوية والفضاء",
          link: "https://www.nasa.gov/",
        },
        nygov: {
          name: "حكومة مدينة نيويورك",
          description: "الموقع الإلكتروني لحكومة مدينة نيويورك",
          link: "https://www1.nyc.gov/",
        },
        fbi: {
          name: "اف,بي,اي",
          description: "مكتب التحقيقات الفدرالي",
          link: "https://www.fbi.gov/",
        },
      },
    },
    web_application: {
      name: "تطبيق ويب",
      description:
        "تطبيقات تفاعلية التي يمكن الوصول إليها من خلال متصفح الويب، بدءًا من البريد الإلكتروني إلى أدوات إدارة المشروع",
      examples: {
        excalidraw: {
          name: "إكسكاليدراو",
          description:
            "طبيق رسم عبر الإنترنت يتيح للمستخدمين الرسم على السبورة البيضاء",
          link: "https://excalidraw.com/",
        },
        chatgpt: {
          name: "ChatGPT",
          description: "ChatGPT هو نموذج لغة كبير تم تطويره من قبل OpenAI",
          link: "https://chat.openai.com/",
        },
        chessdotcom: {
          name: "Chess.com",
          description: "أكبر منصة شطرنج على الإنترنت في العالم",
          link: "https://www.chess.com/",
        },
      },
    },
    forums_and_communities: {
      name: "منتديات ومجتمعات",
      description:
        "المنتديات أو المجتمعات عبر الإنترنت لتبادل المعلومات والآراء والمناقشات",
      examples: {
        piratesoftware: {
          name: "مجتمع برامج القراصنة",
          description: "أفضل مجتمع لمطوري الألعاب وعشاقها",
          link: "https://develop.games/",
        },
        reddit: {
          name: "ريديت",
          description:
            "موقع لتجميع الأخبار الاجتماعية وتقييم محتوى الويب وموقع للمناقشة",
          link: "https://www.reddit.com/",
        },
        stack_overflow: {
          name: "ستاك اوفرفلو",
          description: "موقع أسئلة وأجوبة للمبرمجين المحترفين والمتحمسين",
          link: "https://stackoverflow.com/",
        },
      },
    },
    booking_reservation_system: {
      name: "نظام حجز",
      description: "أنظمة حجز الخدمات",
      examples: {
        airbnb: {
          name: "إير بي إن بي",
          description: "سوق إلكتروني لخدمات الحجز",
          link: "https://www.airbnb.com/",
        },
        bookingdotcom: {
          name: "Booking",
          description: "Booking.com هو مزود خدمة حجز الفنادق عبر الإنترنت",
          link: "https://www.booking.com/",
        },
        tripadvisor: {
          name: "Tripadvisor",
          description:
            "Tripadvisor هي شركة تدير وكالات السفر عبر الإنترنت، ومواقع التسوق المقارنة، وتطبيقات الهاتف المحمول ذات المحتوى الذي ينشئه المستخدمون",
          link: "https://www.tripadvisor.com/",
        },
      },
    },
    utility_website: {
      name: "موقع أدوات المساعدة",
      description:
        "الأدوات والخدمات التي تلبي احتياجات محددة، مثل التنبؤات الجوية أو محولات العملات",
      examples: {
        weather: {
          name: "ويذر",
          description: "توقعات الطقس",
          link: "https://weather.com/",
        },
        currency: {
          name: "زي",
          description: "تحويل العملات",
          link: "https://www.xe.com/",
        },
        online_converter: {
          name: "المحول عبر الإنترنت",
          description:
            "محولات مجانية عبر الإنترنت لمختلف الملفات ووحدات القياس",
          link: "https://www.onlineconverter.com/",
        },
      },
    },
    real_estate_website: {
      name: "موقع العقارات",
      description: "مواقع بيع وشراء وإدارة العقارات",
      examples: {
        zillow: {
          name: "زيلو",
          description: "موقع عقاري لبيع وشراء المنازل",
          link: "https://www.zillow.com/",
        },
        realtor: {
          name: "ريلتورز",
          description: "موقع عقاري لبيع وشراء المنازل",
          link: "https://www.realtor.com/",
        },
        remax_israel: {
          name: "ريماكس إسرائيل",
          description: "ريماكس هي شبكة دولية للوساطة العقارية",
          link: "https://www.remax-israel.com/",
        },
      },
    },
  },
} as const;
